Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: A | character separates the two commands.
es_es: Un carácter «|» separa ambas órdenes.

source: This also means that a | character can't be used inside a map command.
es_es: Esto también significa que no puede usar un carácter «|» dentro de una orden «map».

source: To include one, use <Bar> (five characters).
es_es: Para incluir uno, use <Bar> (cinco caracteres).

source: Example: > :map <F8> :write <Bar> !checkin %<CR>
es_es: Ejemplo: > :map <F8> :write <Bar> !checkin %<CR>

source: The same problem applies to the ":unmap" command, with the addition that you have to watch out for trailing white space.
es_es: El mismo problema afecta a la orden «:unmap», con la adición de que debe tener cuidado con espacio vacío adicional al final de la línea.

source: These two commands are different: > :unmap a | unmap b :unmap a| unmap b
es_es: Estas dos órdenes son diferentes: > :unmap a | unmap b :unmap a| unmap b

source: It is not possible to put a comment directly after a mapping, because the " character is considered to be part of the mapping.
es_es: No es posible insertar un comentario justo antes de una macro, ya que el carácter «"» se considera parte de la macro.

source: You can use |", this starts a new, empty command with a comment.
es_es: Puede usar «|"», iniciando una nueva y vacía orden con un comentario.

source: Abbreviations are a lot like Insert mode mappings.
es_es: Las abreviaturas se parecen mucho a las macros del modo Insetar.

source: The arguments are handled in the same way.
es_es: Los argumentos se tratan de la misma forma.

source: The main difference is the way they are triggered.
es_es: La diferencia principal es la forma en que se ejecutan.

source: An abbreviation is triggered by typing a non-word character after the word.
es_es: Una abreviatura se inicia tecleando un carácter que no sea una palabra, a continuación de una palabra.

source: A mapping is triggered when typing the last character.
es_es: Una macro se inicia al teclear el último carácter.

source: Another difference is that the characters you type for an abbreviation are inserted in the text while you type them.
es_es: Otra diferencia es que los caracteres que usa para una abreviatura se insertan en el texto mientras los teclea.

source: When the abbreviation is triggered these characters are deleted and replaced by what the abbreviation produces.
es_es: Al ejecutar la abreviatura, estos caracteres se eliminan y reemplazan por el resultado de la abreviatura.

source: When typing the characters for a mapping, nothing is inserted until you type the last character that triggers it.
es_es: Al teclear los caracteres de una macro, no se inserta nada hasta que introduce el último carácter que lo inicia.

source: If the 'showcmd' option is set, the typed characters are displayed in the last line of the Vim window.
es_es: Si se define la opción 'showcmd', los caracteres tecleados se muestran en la última línea de la ventana de Vim.

source: An exception is when a mapping is ambiguous.
es_es: Una excepción es cuando la macro es ambigua.

source: Suppose you have done two mappings: >
es_es: Suponga que tiene dos macros: >

source: Now, when you type "aa", Vim doesn't know if it should apply the first or the second mapping.
es_es: Ahora, cuando escribe «aa», Vim no sabe si afecta a la primera o segunda macro.

source: It waits for another character to be typed.
es_es: Espera a que se introduzca otro carácter.

source: If it is an "a", the second mapping is applied and results in "bar".
es_es: Si es una «a», se ejecuta la segunda macro, y cuyo resultado es «bar».

source: If it is a space, for example, the first mapping is applied, resulting in "foo", and then the space is inserted.
es_es: Si es un espacio, por ejemplo, se ejecuta la primera macro, resultando en «foo», para después insertar el espacio.

source: The <script> keyword can be used to make a mapping local to a script.
es_es: Puede usar la palabra clave <script> para hacer que una macro sea local al script.

source: See |:map-<script>|.
es_es: Consulte |:map-<script>|.

source: The <buffer> keyword can be used to make a mapping local to a specific buffer.
es_es: La palabra clave <buffer> se puede usar para que una macro sea local a un búfer específico.

source: See |:map-<buffer>|
es_es: Consulte |:map-<buffer>|.

source: The <unique> keyword can be used to make defining a new mapping fail when it already exists.
es_es: La palabra clave <unique> se puede usar para que definir una macro nueva falle cuando ya existe.

source: Otherwise a new mapping simply overwrites the old one.
es_es: En caso contrario, una nueva macro sencillamente sobreescribe el antiguo.

source: See |:map-<unique>|.
es_es: Consulte |:map-<unique>|.

source: To make a key do nothing, map it to <Nop> (five characters).
es_es: Para que una tecla no haga nada, asígnelo a <Nop> (cinco caracteres).

source: This will make the <F7> key do nothing at all: >
es_es: Lo siguiente hace que la tecla <F7> no tenga efecto alguno: >

source: The Vim editor enables you to define your own commands.
es_es: El editor Vim le permite crear sus propias órdenes.

source: You execute these commands just like any other Command-line mode command.
es_es: Puede ejecutar estas órdenes como cualquier otra orden del modo Línea de órdenes.

source: To define a command, use the ":command" command, as follows: >
es_es: Para definir una orden, use la orden «:command» de la siguiente forma: >

source: Note: User-defined commands must start with a capital letter.
es_es: Nota: Las órdenes definidas por el usuario deben comenzar con una letra mayúscula.

source: You cannot use ":X", ":Next" and ":Print".
es_es: No puede usar «:X», «:Next» y «:Print».

source: The underscore cannot be used!
es_es: ¡No puede usar el guión bajo.

source: You can use digits, but this is discouraged.
es_es: Puede usar dígitos, pero no se recomienda.

source: Just like with the builtin commands, the user defined commands can be abbreviated.
es_es: Al igual que las órdenes integradas, las órdenes definidas por el usuario se pueden abreviar.

source: You need to type just enough to distinguish the command from another.
es_es: Necesita teclear lo justo para distinguir una orden de otra.

source: Command line completion can be used to get the full name.
es_es: El autocompletado de línea de órdenes se puede usar para obtener el nombre completo.

source: User-defined commands can take a series of arguments.
es_es: Las órdenes definidas por el usuario aceptan una serie de argumentos.

source: The number of arguments must be specified by the -nargs option.
es_es: El número de argumentos se debe especificar con la opción «-nargs».

source: For instance, the example :DeleteFirst command takes no arguments, so you could have defined it as follows: >
es_es: Por ejemplo, la orden de ejemplo «DeleteFirst» no permite argumentos, así que lo debe definir del siguiente modo: >

source: However, because zero arguments is the default, you do not need to add "-nargs=0".
es_es: Sin embargo, ya que cero argumentos es el comportamiento predeterminado, no necesita añadir «-nargs=0».

source: The other values of -nargs are as follows:
es_es: A continuación puede ver los otros valores de «-nargs»:

source: -nargs=0 No arguments -nargs=1 One argument -nargs=* Any number of arguments -nargs=?
es_es: -nargs=0 Sin argumentos -nargs=1 Un argumento -nargs=* Cualquier número de argumentos -nargs=?

source: Zero or one argument -nargs=+ One or more arguments
es_es: Cero o más argumentos -nargs=+ Uno o más argumentos

source: Inside the command definition, the arguments are represented by the <args> keyword.
es_es: Dentro de la definición de la orden, los argumentos se representan con la palabra clave <args>.

source: Vim echoes "Hello World".
es_es: Vim muestra «Hello World».

source: However, if you add a double quote, it won't work.
es_es: Sin embargo, no funcionará si añade una comilla doble.

source: The <f-args> keyword contains the same information as the <args> keyword, except in a format suitable for use as function call arguments.
es_es: La palabra clave <f-args> contiene la misma información que la palabra clave <args>, pero en un formato adecuado para usar argumentos que invocan funciones.

source: For example: > :command -nargs=* DoIt :call AFunction(<f-args>) :DoIt a b c
es_es: Por ejemplo: > :command -nargs=* DoIt :call AFunction(<f-args>) :DoIt a b c

source: Some commands take a range as their argument.
es_es: Algunas órdenes toman un rango como argumento.

source: To tell Vim that you are defining such a command, you need to specify a -range option.
es_es: Para indicar a Vim que está definiendo una orden así, debe especificar una opción «-range».

source: The values for this option are as follows:
es_es: A continuación puede ver los valores de esta opción:

source: -range Range is allowed; default is the current line.
es_es: -range El rango está permitido, el valor predeterminado es la línea actual.

source: -range=% Range is allowed; default is the whole file.
es_es: -range=% El rango está permitido, el valor predeterminado es el archivo completo.

source: -range={count} Range is allowed; the last number in it is used as a single number whose default is {count}.
es_es: -range={número} El rango está permitido, el último número presente se usa como un sólo número cuyo valor predeterminado es {número}.

source: When a range is specified, the keywords <line1> and <line2> get the values of the first and last line in the range.
es_es: Cuando un rango se especifica, las palabras clave <line1> y <line2> obtienen el valor de la primera y última línea del rango.

source: For example, the following command defines the SaveIt command, which writes out the specified range to the file "save_file": >
es_es: Por ejemplo, la siguiente orden define la orden «SaveIt», que escribe el rango especificado al archivo «save_file»: >

source: Finally, you have the <lt> keyword.
es_es: Por último, tiene la palabra clave <lt>.

source: It stands for the character <.
es_es: Simboliza el carácter «<».

source: Use this to escape the special meaning of the <> items mentioned.
es_es: Úselo para escapar el significado especial de los elementos <> mencionados.

source: To delete a user command use ":delcommand".
es_es: Use «:delcommand» para eliminar una orden de usuario.

source: It takes a single argument, which is the name of the command.
es_es: Toma un único argumento, el nombre de la orden.

source: An autocommand is a command that is executed automatically in response to some event, such as a file being read or written or a buffer change.
es_es: Una orden automática (Autocommand) es una orden a ejecutar en respuesta otro evento, un archivo siendo leído y editado o un cambio en un búfer, por ejemplo.

source: Through the use of autocommands you can train Vim to edit compressed files, for example.
es_es: Por ejemplo, Vim puede editar archivos comprimidos a través de las órdenes automáticas.

source: That is used in the |gzip| plugin.
es_es: La extensión |gzip| hace uso de esto.

source: Autocommands are very powerful.
es_es: Las órdenes automáticas son muy potentes.

source: Use them with care and they will help you avoid typing many commands.
es_es: Úselos con cuidado, y le ayudarán a disminuir el número de órdenes que introduce.

source: Use them carelessly and they will cause a lot of trouble.
es_es: Úselos sin cuidado, y generarán un gran número de problemas.

source: Suppose you want to replace a datestamp on the end of a file every time it is written.
es_es: Suponga que desea reemplazar una marca de tiempo al final del archivo cada vez que se escriba.

source: First you define a function: >
es_es: Primero, define una función: >

source: You want this function to be called each time, just before a file is written.
es_es: Desea que esta función se invoque justo antes de guardar un archivo.

source: This will make that happen: >
es_es: Lo siguiente lo logra este objetivo: >

source: The [group] name is optional.
es_es: El elemento [grupo] es opcional.

source: It is used in managing and calling the commands (more on this later).
es_es: Se usa al gestionar e invocar las órdenes (más información más adelante).

source: The {events} parameter is a list of events (comma separated) that trigger the command.
es_es: El parámetro {eventos} es una lista separada por comas de eventos que inician la orden.

source: {file_pattern} is a filename, usually with wildcards.
es_es: {patrón_archivo} es un nombre de archivo, a menudo con comodines.

source: For example, using "*.txt" makes the autocommand be used for all files whose name end in ".txt".
es_es: Por ejemplo, usar «*.txt» provoca que la orden automática afecte a todos los archivos cuyo nombre termina en «.txt».

source: The optional [nested] flag allows for nesting of autocommands (see below), and finally, {command} is the command to be executed.
es_es: La elemento opcional [anidado] permite anidar órdenes automáticas (a continuación), y, por último, {orden} es la orden a ejecutar.

source: One of the most useful events is BufReadPost.
es_es: Uno de los eventos más útiles es «BufReadPost».

source: It is triggered after a new file is being edited.
es_es: Se inicia después de editar un nuevo archivo.

source: It is commonly used to set option values.
es_es: Se usa habitualmente para definir valores para opciones.

source: For example, you know that "*.gsm" files are GNU assembly language.
es_es: Por ejemplo, sabe que los archivos «.gsm» están escritos en lenguaje ensamblador de GNU.

source: To get the syntax file right, define this autocommand: >
es_es: Especifique esta orden para obtener la adecuada sintaxis de archivo: >

source: If Vim is able to detect the type of file, it will set the 'filetype' option for you.
es_es: Si Vim es capaz de detectar el tipo de archivo, definirá la opción 'filetype' automáticamente.

source: This triggers the Filetype event.
es_es: Los siguiente incia el evento «Filetype».

source: Use this to do something when a certain type of file is edited.
es_es: Puede usarlo para iniciar una acción al editar un tipo de archivo en particular.

source: For example, to load a list of abbreviations for text files: >
es_es: Por ejemplo, para cargar una lista de abreviaturas de archivos de texto: >

source: The {file_pattern} argument can actually be a comma-separated list of file patterns.
es_es: El argumento {patrón_archivo] puede ser una lista separada por comas de patrones de archivo.

source: For example: "*.c,*.h" matches files ending in ".c" and ".h".
es_es: Por ejemplo, "*.c,*.h" coincide con los archivos terminados en «.c» y «.h».

source: The usual file wildcards can be used.
es_es: Puede usar los comodines de archivo habituales.

source: Here is a summary of the most often used ones:
es_es: Aquí tiene un resumen de los más usados:

source: * Match any character any number of times ?
es_es: * Busca cualquier caracteres cualquier número de veces ?

source: Match any character once [abc] Match the character a, b or c .
es_es: Busca cualquier carácter una vez [abc] Busca el carácter a, b o c .

source: Matches a dot a{b,c} Matches "ab" and "ac"
es_es: Busca un punto a{b,c} Busca «ab» y «ac»

source: Note: When working on a system that uses a backslash as file separator, such as MS-Windows, you still use forward slashes in autocommands.
es_es: Nota: Al trabajar con un sistema que usa la barra inversa como separador de archivos, como MS-Windows, necesita una barra inclinada en las órdenes automáticas.

source: This makes it easier to write the pattern, since a backslash has a special meaning.
es_es: Esto facilita escribir un patrón, ya que la barra inversa tiene un significado especial.

source: It also makes the autocommands portable.
es_es: También hace portables las órdenes automáticas.

source: To delete an autocommand, use the same command as what it was defined with, but leave out the {command} at the end and use a !.
es_es: Para eliminar una orden automática, use la misma orden con la que se definió, pero omitiendo la {orden} al final y usando «!».

source: The list can be very long, especially when filetype detection is used.
es_es: Esta lista puede ser muy largo, en particular si se utiliza la detección de tipo de archivo.

source: To list only part of the commands, specify the group, event and/or pattern.
es_es: Para listar sólo parte de las órdenes, especifique el grupo, evento y/o patrón.

source: For example, to list all BufNewFile autocommands: >
es_es: Por ejemplo, para listar todas las órdenes automáticas para «BufNewFile»: >

source: Using "*" for the event will list all the events.
es_es: Usar «*» como el evento lista todos los eventos.

source: To list all autocommands for the cprograms group: >
es_es: Para listar todas las órdenes automáticas del grupo cprograms: >

source: The {group} item, used when defining an autocommand, groups related autocommands together.
es_es: El elemento {grupo}, usado al definir una orden automática, agrupa órdenes automáticas relacionadas.

source: This can be used to delete all the autocommands in a certain group, for example.
es_es: Se puede usar para eliminar todas las órdenes automáticas en un grupo particular, por ejemplo.

source: When defining several autocommands for a certain group, use the ":augroup" command.
es_es: Al definir varias órdenes automáticas para un grupo particular, use la orden «:augroup».

source: For example, let's define autocommands for C programs: >
es_es: Por ejemplo, vamos a definir unas órdenes automáticas para programas C: >

source: Generally, commands executed as the result of an autocommand event will not trigger any new events.
es_es: Habitualmente, las órdenes ejecutadas como resultado de un evento de orden automática no iniciarán ningún evento nuevo.

source: If you read a file in response to a FileChangedShell event, it will not trigger the autocommands that would set the syntax, for example.
es_es: Si lee un archivo como respuesta a un evento «FileChangedShell», no iniciará las órdenes automáticas que definirían la sintaxis, por ejemplo.

source: To make the events triggered, add the "nested" argument: >
es_es: Para que se los eventos se inicien, añada el argumento «nested»: >

source: It is possible to trigger an autocommand by pretending an event has occurred.
es_es: Es posible iniciar una orden automática simulando un evento.

source: This is useful to have one autocommand trigger another one.
es_es: Es útil para que una orden automática inicie otra.

source: This defines an autocommand that is triggered when a new file has been edited.
es_es: Esto define una orden automática que se inicia al editar un nuevo archivo.

source: The file name must end in ".new".
es_es: El nombre de archivo debe terminar con «.new».

source: The ":execute" command uses expression evaluation to form a new command and execute it.
es_es: La orden «:execute» usa expresiones de evaluación para formar una nueva orden y ejecutarla.

source: When editing the file "tryout.c.new" the executed command will be: >
es_es: La orden ejecutada al editar el archivo «prueba.c.new» sería: >

source: ":doautocmd" executes on the current buffer.
es_es: «:doautocmd» se ejecuta en el búfer actual.

source: The ":doautoall" command works like "doautocmd" except it executes on all the buffers.
es_es: La orden «:doautoall» funciona como «doautocmd», con la diferencia de que afecta a todos los búfers.

source: The commands executed by an autocommand are Command-line commands.
es_es: Las órdenes ejecutadas por una orden automática son órdenes del modo Línea de órdenes.

source: If you want to use a Normal mode command, the ":normal" command can be used.
es_es: Si desea usar una orden del modo normal, puede usar la orden «:normal».

source: This will make the cursor jump to the last line of *.log files when you start to edit it.
es_es: Esto hará que el cursor salte a la última línea de archivos «*.log» cuando empieza a editarlo.

source: Using the ":normal" command is a bit tricky.
es_es: Usar la orden «:normal» es un poco difícil.

source: First of all, make sure its argument is a complete command, including all the arguments.
es_es: Primero, compruebe que su argumento es una orden completa, incluyendo todos los argumentos.

source: When you use "i" to go to Insert mode, there must also be a <Esc> to leave Insert mode again.
es_es: Cuando usa una «i» para entrar el modo Insertar, también debe tener un <Esc> para abandonar el modo Insertar.

source: If you use a "/" to start a search pattern, there must be a <CR> to execute it.
es_es: Si usa «/» para iniciar una búsqueda de un patrón, debe usar <CR> para ejecutarlo.

source: The ":normal" command uses all the text after it as commands.
es_es: La orden «:normal» usa todo el texto a continuación como órdenes.

source: Thus there can be no | and another command following.
es_es: Por ello, no debe estar presente «|» y una orden a continuación.

source: To work around this, put the ":normal" command inside an ":execute" command.
es_es: Para solucionar este problema, ubique la orden «:normal» dentro de una orden «:execute».

source: This also makes it possible to pass unprintable characters in a convenient way.
es_es: También posibilita pasar caracteres no imprimibles de una forma cómoda.

source: This also shows the use of a backslash to break a long command into more lines.
es_es: Esto también muestra el usa de la barra inversa para dividir una orden en varias líneas.

source: This can be used in Vim scripts (not at the command line).
es_es: Se puede usar en scripts de Vim (no en la línea de órdenes).

source: When you want the autocommand do something complicated, which involves jumping around in the file and then returning to the original position, you may want to restore the view on the file.
es_es: Si desea que la orden automática haga algo más complicado, que incluya saltar de un punto a otro en el archivo para volver finalmente a la posición inicial, puede que desee restaurar la vista del archivo.

source: See |restore-position| for an example.
es_es: Para un ejemplo, consulte |restore-position|.

source: At times, you will not want to trigger an autocommand.
es_es: A veces, no querrá iniciar una orden automática.

source: The 'eventignore' option contains a list of events that will be totally ignored.
es_es: La opción 'eventignore' contiene una lista de eventos a ignorar.

source: For example, the following causes events for entering and leaving a window to be ignored: >
es_es: Por ejemplo, lo siguiente provoca que se ignoren los siguientes eventos iniciados al entrar y salir de un programa: >

source: *usr_11.txt* For Vim version 7.3.
es_es: *usr_11.esx* Para Vim versión 7.3.

source: |11.1| Basic recovery |11.2| Where is the swap file?
es_es: |11.1| Recuperación básica |11.2| ¿Dónde está el archivo de intercambio?

source: In most cases recovering a file is quite simple, assuming you know which file you were editing (and the harddisk is still working).
es_es: En la mayoría de los casos, recuperar un archivo es bastante sencillo, si suponemos que sabe qué archivo estaba editando (y el disco duro aún funciona).

source: Start Vim on the file, with the "-r" argument added: >
es_es: Inicie Vim con el archivo y el argumento «-r»: >

source: Vim will read the swap file (used to store text you were editing) and may read bits and pieces of the original file.
es_es: Vim leerá el archivo de intercambio (empleado para almacenar el texto editado) y puede que lea bits y porciones del texto original.

source: If Vim recovered your changes you will see these messages (with different file names, of course):
es_es: Verá los siguientes mensajes si todo ha ido bien (con nombres de fichero diferentes, por supuesto).
